## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.firewall-cinema.google_compute_firewall.rules["allow-http-ingress"] will be created
+   resource "google_compute_firewall" "rules" {
+       creation_timestamp = (known after apply)
+       destination_ranges = (known after apply)
+       direction          = "INGRESS"
+       enable_logging     = (known after apply)
+       id                 = (known after apply)
+       name               = "allow-http-ingress"
+       network            = "cinema"
+       priority           = 1000
+       project            = "terrateam-362405"
+       self_link          = (known after apply)
+       source_ranges      = [
+           "0.0.0.0/0",
        ]

+       allow {
+           ports    = [
+               "80",
+               "443",
            ]
+           protocol = "tcp"
        }

+       log_config {
+           metadata = "INCLUDE_ALL_METADATA"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
